# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение
a = 12
b = 12321

print(a+b)
print(a-b)
print(a*b)