# Даны действительные числа x и y. Получить x − y / 1 + xy

x = 1223
y = 1543534

print (x - y / 1 + x * y)