# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел
import math

a = 1312312
b = 129873872

print ((a+b)/2)
print (math.sqrt(a*b))